[{
  "_id": {
    "$oid": "63175a4b019cc2ca172f84a6"
  },
  "title": "برعاية فخامة رئيس الجمهورية: جامعة حضرموت تحتفي بتكريم أوائل الخريجين والحائزين على مرتبة الشرف من مختلف كليات الجامعة للعام الجامعي 2020 – 2021 م",
  "body": "نظمت جامعة حضرموت بقاعة الفقيد علي هود باعباد بديوان رئاسة الجامعة حفل التخرج السنوي لتكريم أوائل الخريجين والحائزين على مرتبة الشرف في جميع التخصصات بكليات الجامعة المختلفة، وذلك برعاية كريمة من فخامة الأخ المشير عبدربه منصور هادي رئيس الجمهورية.",
  "date": {
    "$date": {
      "$numberLong": "1662422400000"
    }
  },
  "employee": 27380,
  "__v": 0
},{
  "_id": {
    "$oid": "63175a81019cc2ca172f84b1"
  },
  "title": "برئاسة رئيس الجامعة: اجتماع رؤساء لجان أسبوع البحث العلمي الثاني",
  "body": "عقدت اللجنة العليا لأسبوع البحث العلمي الثاني بجامعة حضرموت صباح اليوم اجتماعها الثالث برئاسة الأستاذ الدكتور محمد سعيد خنبش رئيس الجامعة، وبحضور نواب رئيس الجامعة، ورؤساء اللجان الخاصة. ناقش الاجتماع الاستعدادات النهائية لانطلاق فعاليات أسبوع البحث العلمي الثاني بجامعة حضرموت الثلاثاء المقبل 15مارس بحفل الافتتاح الذي بحضور السلطة المحلية بحضرموت وعدد من قيادات الجامعة وعمداء الكليات ونوابهم وروساء الأقسام العلمية ورؤساء المراكز العلمية والباحثين والطلاب.",
  "date": {
    "$date": {
      "$numberLong": "1662768000000"
    }
  },
  "employee": 27380,
  "__v": 0
},{
  "_id": {
    "$oid": "63175ab0019cc2ca172f84bc"
  },
  "title": "نحو شراكة فاعلة بين الجامعتين: لقاء مهم عبر تقنية الزوم بين رئيس جامعة حضرموت ونائب رئيس جامعة بتروناس تكنولوجي الماليزية",
  "body": "ترأس الأستاذ الدكتور محمد سعيد خنبش رئيس جامعة حضرموت صباح هذا اليوم الموافق ٨ مارس العام ٢٠٢٢م، والأستاذ الدكتور إبراهيم عبدالمطلب نائب رئيس جامعة بتروناس تكنولوجي الماليزية، اللقاء المهم والجامع لأعمال اللجان المشتركة بين الجامعتين، عبر تقنية الزوم. وقد تمخض اللقاء عن جُملة من البنود والتوصيات تنفيذًا للاتفاقية المبرمة بين الجامعتين.",
  "date": {
    "$date": {
      "$numberLong": "1663804800000"
    }
  },
  "employee": 27380,
  "__v": 0
},{
  "_id": {
    "$oid": "63175ae9019cc2ca172f84c7"
  },
  "title": "تُعلن نيابة شئون الطلاب بجامعة حضرموت عن بدء إجراءات التنسيق والقبول للعام الجامعي 2022-2023م",
  "body": "تُعلن نيابة شئون الطلاب بجامعة حضرموت عن بدء إجراءات التنسيق والقبول للعام الجامعي 2022-2023م",
  "date": {
    "$date": {
      "$numberLong": "1663286400000"
    }
  },
  "employee": 27380,
  "__v": 0
}]