import '../css/newDetails.css';
import { useParams } from "react-router-dom/cjs/react-router-dom.min";
import new1 from '../images/new1.jpg';
import new2 from '../images/new2.jpg';
import new3 from '../images/new3.jpg';

let news = [
    {
        id: 1,
        title: 'برعاية فخامة رئيس الجمهورية: جامعة حضرموت تحتفي بتكريم أوائل الخريجين والحائزين على مرتبة الشرف من مختلف كليات الجامعة للعام الجامعي 2020 – 2021 م',
        body: 'نظمت جامعة حضرموت بقاعة الفقيد علي هود باعباد بديوان رئاسة الجامعة حفل التخرج السنوي لتكريم أوائل الخريجين والحائزين على مرتبة الشرف في جميع التخصصات بكليات الجامعة المختلفة، وذلك برعاية كريمة من فخامة الأخ المشير عبدربه منصور هادي رئيس الجمهورية.',
        date: '10 مارس 2022',
        dateNo: '2022-03-10',
        image: new1
    },
    {
        id: 2,
        title: 'برئاسة رئيس الجامعة: اجتماع رؤساء لجان أسبوع البحث العلمي الثاني',
        body: 'عقدت اللجنة العليا لأسبوع البحث العلمي الثاني بجامعة حضرموت صباح اليوم اجتماعها الثالث برئاسة الأستاذ الدكتور محمد سعيد خنبش رئيس الجامعة، وبحضور نواب رئيس الجامعة، ورؤساء اللجان الخاصة. ناقش الاجتماع الاستعدادات النهائية لانطلاق فعاليات أسبوع البحث العلمي الثاني بجامعة حضرموت الثلاثاء المقبل 15مارس بحفل الافتتاح الذي بحضور السلطة المحلية بحضرموت وعدد من قيادات الجامعة وعمداء الكليات ونوابهم وروساء الأقسام العلمية ورؤساء المراكز العلمية والباحثين والطلاب.',
        date: '10 مارس 2022',
        dateNo: '2022-03-10',
        image: new2
    },
    {
        id: 3,
        title: 'نحو شراكة فاعلة بين الجامعتين: لقاء مهم عبر تقنية الزوم بين رئيس جامعة حضرموت ونائب رئيس جامعة بتروناس تكنولوجي الماليزية',
        body: 'ترأس الأستاذ الدكتور محمد سعيد خنبش رئيس جامعة حضرموت صباح هذا اليوم الموافق ٨ مارس العام ٢٠٢٢م، والأستاذ الدكتور إبراهيم عبدالمطلب نائب رئيس جامعة بتروناس تكنولوجي الماليزية، اللقاء المهم والجامع لأعمال اللجان المشتركة بين الجامعتين، عبر تقنية الزوم. وقد تمخض اللقاء عن جُملة من البنود والتوصيات تنفيذًا للاتفاقية المبرمة بين الجامعتين.',
        date: '9 مارس 2022',
        dateNo: '2022-03-09',
        image: new3
    },
{
        id: 4,
        title: 'برعاية فخامة رئيس الجمهورية: جامعة حضرموت تحتفي بتكريم أوائل الخريجين والحائزين على مرتبة الشرف من مختلف كليات الجامعة للعام الجامعي 2020 – 2021 م',
        body: 'نظمت جامعة حضرموت بقاعة الفقيد علي هود باعباد بديوان رئاسة الجامعة حفل التخرج السنوي لتكريم أوائل الخريجين والحائزين على مرتبة الشرف في جميع التخصصات بكليات الجامعة المختلفة، وذلك برعاية كريمة من فخامة الأخ المشير عبدربه منصور هادي رئيس الجمهورية.',
        date: '10 مارس 2022',
        dateNo: '2022-03-10',
        image: new1
    },
    {
        id: 5,
        title: 'برئاسة رئيس الجامعة: اجتماع رؤساء لجان أسبوع البحث العلمي الثاني',
        body: 'عقدت اللجنة العليا لأسبوع البحث العلمي الثاني بجامعة حضرموت صباح اليوم اجتماعها الثالث برئاسة الأستاذ الدكتور محمد سعيد خنبش رئيس الجامعة، وبحضور نواب رئيس الجامعة، ورؤساء اللجان الخاصة. ناقش الاجتماع الاستعدادات النهائية لانطلاق فعاليات أسبوع البحث العلمي الثاني بجامعة حضرموت الثلاثاء المقبل 15مارس بحفل الافتتاح الذي بحضور السلطة المحلية بحضرموت وعدد من قيادات الجامعة وعمداء الكليات ونوابهم وروساء الأقسام العلمية ورؤساء المراكز العلمية والباحثين والطلاب.',
        date: '10 مارس 2022',
        dateNo: '2022-03-10',
        image: new2
    },
    {
        id: 6,
        title: 'نحو شراكة فاعلة بين الجامعتين: لقاء مهم عبر تقنية الزوم بين رئيس جامعة حضرموت ونائب رئيس جامعة بتروناس تكنولوجي الماليزية',
        body: 'ترأس الأستاذ الدكتور محمد سعيد خنبش رئيس جامعة حضرموت صباح هذا اليوم الموافق ٨ مارس العام ٢٠٢٢م، والأستاذ الدكتور إبراهيم عبدالمطلب نائب رئيس جامعة بتروناس تكنولوجي الماليزية، اللقاء المهم والجامع لأعمال اللجان المشتركة بين الجامعتين، عبر تقنية الزوم. وقد تمخض اللقاء عن جُملة من البنود والتوصيات تنفيذًا للاتفاقية المبرمة بين الجامعتين.',
        date: '9 مارس 2022',
        dateNo: '2022-03-09',
        image: new3
    },
]

const NewDetails = () => {
    const { id } = useParams();

    return (
        <div className="new-details-page">
            {
                news.map((e)=> {
                    if (+id === e.id) {
                        return (
                            <article className="new-details">
                                <div className="image">
                                    <img src={e.image} alt="" />
                                </div>
                                <header>
                                    <h1 className="title">{e.title}</h1>
                                    <time datetime={e.dateNo} className="date">{e.date}</time>
                                </header>
                                <section className='body'>{e.body}</section>
                            </article>
                        )
                    }
                })
            }
        </div>
    );
}

export default NewDetails;